In [46]:
import os 
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# Reading data

In [47]:
info = {
    'names': ['dev','shiv','raj','deva','suraj'],
    'age': [23,21,19,18,17],
    'height':[4.3,5.3,5.6,5.7,6.1],
}
d1=pd.DataFrame(info)
d1

   names  age  height
0    dev   23     4.3
1   shiv   21     5.3
2    raj   19     5.6
3   deva   18     5.7
4  suraj   17     6.1

In [51]:
d2 =pd.read_csv('datasample.csv')
d2

    name  english  math  science
0  arjun       45    75       34
1  jyoti       34    53       64
2    dev       45    64       64
3  suraj       33    56       87

In [52]:
pd.set_option('display.max_coloumn',None)

OptionError: No such keys(s): 'display.max_coloumn'

In [ ]:
df= pd.read_excel('Canada.xlsx',
              sheet_name=1,
              skiprows=20,
              skipfooter=2,

            )
df

## looking at the data 
- head(n) - top n rows of the data 
- tail(n) - bottom n rows of the data
- sample(n)- random n samples of the data
- info(n) - coloumn wise datatypes
- describe() - summary statistics of the data

In [ ]:
df.head()

In [ ]:
df.tail

In [ ]:
df.sample()

In [ ]:
df.info()

In [ ]:
df.describe()

In [ ]:
df.describe(include=object)

## coloumn wise data

In [ ]:
df.columns

In [ ]:
df['OdName']   # series object

In [ ]:
df['AreaName']

In [ ]:
# multiple coloumns

df[['AreaName','RegName']] #data frame object

In [ ]:
years = list(range(1980,2014))
df[years]

In [ ]:
df[['OdName',1980,1990,2000,2010,2011,2012,2013]]

In [ ]:
# Row wise access using loc and iloc

df.loc[194]   #Label wise location

In [ ]:
df.iloc[0]   #Index wise location

In [ ]:
df.iloc[:10,[0,1,2,3,4,5]]

In [ ]:
df.loc[:10,['OdName',1980,1990,2000,2010]]

# Manipulating Data

In [53]:
d2['english']+d2['math']+d2['science']

    name  english  math  science
0  arjun       45    75       34
1  jyoti       34    53       64
2    dev       45    64       64
3  suraj       33    56       87

In [56]:
d2['Total'] = d2['english'] + d2['math']+ d2['science']
d2

    name  english  math  science  Total
0  arjun       45    75       34    154
1  jyoti       34    53       64    151
2    dev       45    64       64    173
3  suraj       33    56       87    176

In [57]:
d2['Average'] = d2['Total']/3
d2

    name  english  math  science  Total    Average
0  arjun       45    75       34    154  51.333333
1  jyoti       34    53       64    151  50.333333
2    dev       45    64       64    173  57.666667
3  suraj       33    56       87    176  58.666667